app/Controllers/Admin/ProductController.php

SELECT *
FROM `products`
---
    public function index()
    {
        $products = (new Product())->withImages()->withCategory()->get()->getResultObject();